import { Injectable } from '@angular/core';

import { IQuestionDto } from '../dto/qustion.dto';

@Injectable({
  providedIn: 'root',
})
export class QuestionService {
  questions: IQuestionDto[] = [
    {
      question: 'როგორ ხდება კურსებზე რეგისტრაცია და შერჩევა?',
      answer: 'კურსზე რეგისტრაციისთვის უნდა გაიარო რამდენიმე ეტაპი:',
      answerList: [
        'I ეტაპი - პირველ ეტაპზე საჭიროა, შეავსო სასურველი კურსისთვის განკუთვნილი სარეგისტრაციო ფორმა, რომელიც განთავსებულია კურსის შიდა გვერდზე. კურსზე რეგისტრაციის დასრულების შემდეგ დაიწყება შემოსული განცხადებების გადარჩევა. ',
        'II ეტაპი - შერჩევის მეორე ეტაპი კურსების მიხედვით განსხვავებულია, ზოგიერთი კურსისთვის მოიცავს პრე-ტესტს, ზოგიერთ კურსზე კი უნარების ტესტს, სადაც მინიმალური ზღვარის გადალახვის შემთხვევაში გადახვალ შერჩევის შემდეგ ეტაპზე.',
        'III ეტაპი - მესამე ეტაპი კურსების მიხედვით განსხვავდება: Advance კურსებზე, სადაც მოითხოვება გარკვეული ტექნიკური ცოდნა, მონაწილეებმა უნდა დაწერონ ტექნიკური ტესტი ცოდნის დონის შესამოწმებლად, ხოლო კურსებზე, სადაც რაიმე ტიპის წინასწარი ცოდნა მოთხოვნილი არ არის უნდა შეასრულოთ ტექნიკური დავალება, რაც თქვენი კვლევისა და თვითსწავლის უნარს ამოწმებს.',
        'IV ეტაპი - შერჩევის ბოლო მეოთხე ეტაპი მოიცავს გასაუბრებას შესარჩევ კომისიასთან. გასაუბრების წარმატებით გავლის შემთხვევაში ჩაირიცხებით კურსზე და გაფორმდება შესაბამისი ხელშეკრულება.',
      ],
      id: 1,
      warning:
        '* სანამ კურსზე დარეგისტრირდები მნიშვნელოვანია, ყურადღებით წაიკითხო კურსის აღწერა, ნახო რას ისწავლი კურსის განმავლობაში და გაიგო გააჩნია თუ არა კურსს დასწრების წინაპირობა. ',
    },
    {
      question: 'შემიძლია თუ არა ერთზე მეტ კურსზე რეგისტრაცია?',
      answer:
        'TBC X USAID ტექნოლოგიური განათლებისთვის პროგრამაში თითოეულ კანდიდატს აქვს მხოლოდ ერთი კურსის გავლის შესაძლებლობა. გარდა Information Security და Python კურსებისა, სადაც Basic დონის გავლის შემდეგ შესაძლებელია სწავლის გაგრძელება Advance დონეზე.',
      id: 2,
    },
    {
      question: 'რა ღირს სწავლა პროგრამის ფარგლებში?',
      answer:
        'პროგრამის ფარგლებში კურსებზე სწავლა სრულიად დაფინანსებულია თიბისი ბანკისა და USAID-ის მიერ.',
      id: 3,
    },
    {
      question: 'შეხვედრები ფიზიკურად ტარდება თუ ონლაინ?',
      answer: 'კურსებზე სწავლება მიმდინარეობს ონლაინ რეჟიმში.',
      warning:
        '*iOS Development კურსის სტუდენტებს საჭიროების შემთხვევაში შეუძლიათ ისარგებლონ სპეციალურად პროექტის ფარგლებში მოწყობილი iOS ლაბორატორიით, რომელიც მდებარეობს თიბისი IT აკადემიაში.',
      id: 4,
    },
    {
      question: 'რა ენაზე მიმდინარეობს სწავლება?',
      answer: 'კურსებზე სწავლება მიმდინარეობს სრულად ქართულ ენაზე.',
      id: 5,
    },
    {
      question: 'რა დროს ტარდება ლექციები?',
      answer:
        'ლექციების დრო შეიძლება განსხვავდებოდეს კურსების მიხედვით, თუმცა ლექციები უმეტესად ტარდება საღამოს პერიოდში.',
      id: 6,
    },
    {
      question: 'როგორია სწავლების მეთოდოლოგია?',
      answer:
        'TBC X USAID ტექნოლოგიური განათლებისთვის პროექტის ფარგლებში სასწავლო პროგრამებს ქმნიან დარგის წამყვანი ექსპერტები. კურსები ორიენტირებულია სწავლების თანამედროვე მეთოდების გამოყენებით სტუდენტი მოამზადოს რეალური სამუშაო გარემოსთვის ლაბების, პრაქტიკული დავალებების, ვორქშოპებისა და ინდივიდუალური პროექტების გზით, რაც მნიშვნელოვანია შემდგომი პროფესიული განვითარებისთვის. თითოეული კურსის  ფარგლებში შინაარსის, თემების და სწავლების მეთოდოლოგიის შესახებ დეტალური ინფორმაციის გასაცნობად, გთხოვთ, იხილოთ აღწერები კურსების მიხედვით.',
      id: 7,
    },
    {
      question: 'რა მოხდება კურსის დასრულების შემდეგ?',
      answer:
        'კურსის წარმატებით დასრულების შემდეგ მიიღებ შესაბამისი კურსის გავლის დამადასტურებელ სერტიფიკატს. წარმატებულ სტუდენტებს შესაძლებლობა ექნებათ დასაქმდნენ თიბისი ბანკსა და პარტნიორ კომპანიებში.',
      id: 8,
    },
  ];
  getQuestions() {
    return [...this.questions];
  }
  getQuestion(id: number) {
    return this.questions.filter((question) => question.id === id)[0];
  }
}
